In [2]:
import pandas as pd
import numpy as np

In [4]:
string_data=pd.Series(['aardasd','arkcsada',np.nan,'avocado'])
string_data

0     aardasd
1    arkcsada
2         NaN
3     avocado
dtype: object

In [10]:
string_data.isnull(),string_data.isna()

(0    False
 1    False
 2     True
 3    False
 dtype: bool,
 0    False
 1    False
 2     True
 3    False
 dtype: bool)

In [15]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [17]:
string_data.notnull(),string_data.notna()

(0    False
 1     True
 2    False
 3     True
 dtype: bool,
 0    False
 1     True
 2    False
 3     True
 dtype: bool)

In [20]:
string_data=string_data.dropna()

In [21]:
string_data

1    arkcsada
3     avocado
dtype: object

In [23]:
from numpy import nan as NA
data=pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [27]:
data.dropna(inplace=True)

In [28]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [29]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
        [NA, NA, NA], [NA, 6.5, 3.]])

In [33]:
cleaned=data.dropna()

In [34]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [36]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.668976  0.737992  1.451797
1 -0.225695  0.349492 -0.073608
2  1.824398 -0.253469 -1.332313
3  1.416881  0.219519  0.138909
4  1.800326  1.338266 -1.469026
5 -0.387412 -1.072996 -1.583961
6 -1.606118  0.307178  1.813142

In [41]:
df.iloc[:4,1:]=NA

In [42]:
df

          0         1         2
0  0.668976       NaN       NaN
1 -0.225695       NaN       NaN
2  1.824398       NaN       NaN
3  1.416881       NaN       NaN
4  1.800326  1.338266 -1.469026
5 -0.387412 -1.072996 -1.583961
6 -1.606118  0.307178  1.813142

In [43]:
df.fillna(np.mean(df))

          0         1         2
0  0.668976  0.190816 -0.413282
1 -0.225695  0.190816 -0.413282
2  1.824398  0.190816 -0.413282
3  1.416881  0.190816 -0.413282
4  1.800326  1.338266 -1.469026
5 -0.387412 -1.072996 -1.583961
6 -1.606118  0.307178  1.813142

In [46]:
df=pd.DataFrame(np.random.randint(1,10,(4,4)),columns=["a","b","c","d"])
df

   a  b  c  d
0  3  5  5  2
1  3  5  4  7
2  2  5  5  7
3  7  4  7  6

In [47]:
df.iloc[:2,2:]=NA

In [49]:
df

   a  b    c    d
0  3  5  NaN  NaN
1  3  5  NaN  NaN
2  2  5  5.0  7.0
3  7  4  7.0  6.0

In [60]:
df.fillna(df.mean(),inplace=True)

In [61]:
df

   a  b    c    d
0  3  5  6.0  6.5
1  3  5  6.0  6.5
2  2  5  5.0  7.0
3  7  4  7.0  6.0

In [73]:
# Remove duplicates
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
        'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [70]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

In [71]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [75]:
data['v1']=range(7)
data.drop

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6